<template>
  <div class="about">
    <h1>KRiT frontend test work</h1>
    <div class="information">
      <h2>Что я использовал:</h2>
      <ul>
        <li><strong><b>Vue-cli</b></strong>: babel, vue.js v2, vue-router, vuex</li>
        <li><strong><b>Anychart.js</b></strong> - не знал можно ли, но на hh у вас написано о нем, ну я и решил поучиться</li>
        <li><strong><b>Bootstrap-vue 4</b></strong> - не приходилось использовать версию для vue, но мне очень понравилось</li>
      </ul>

      <h2>Информация</h2>
      <ul>
        <li>Моя база данных обычный массив данных без json формата и тд, т.к. на сколько я знаю github деплой запускает только фронт на nginx. Поэтому я полагаю - это основной виновник торжества медленной загрузки, учитывая что экспортирую я два файла в vuex стор</li>
        <li>Так же AnychartJS был использован на основе оф. примера с их сайта, vue integration. Уверен, можно реструктурировать форму даных.</li>
        <li>Данные сгенерированы через https://www.json-generator.com/</li>
        <li><img src="https://samatdev.github.io/KRiT//bd.jpg" alt="bd"></li>
        <li>Кнопка обновить данные вызывает store action через 3 секунды после нажатия (имитация загрузки), затем заменяет данные другим файлом, которые меняются без перезагрузки</li>
      </ul>

      <h2>Какие сложности возникли?</h2>
      <ol>
        <li>Сначала было не понятно о чем идет речь в задании, то есть без описании формул данных и тд, к тому же картинка в документе низкого качества, поэтому это еще больше усложнило задачу, при этом мое приложение сильно отличается от того, что на скрине. Я так и не понял как данные сверху (над диаграммой) связаны с теми, что ниже.</li>
        <li>По началу долго вникал в диаграмму и табличные данные, как я это воспринял и реализовал: <strong>лин. диаграмма</strong> - ось абсцисс у нас дни, т.к. имеем 7 точек, значит это последние 7 дней от актуальной даты, я их сделал динамическими,хотя наверное это бесполезно (но я предположил, что они меняются каждый день, да и просто сам себе задачу слегка усложнил, интересно же). Ордината - данные за каждый день (7 последний дней не учитывая Date.now). В таблице данные так же вычисляемые на стороне клиента, наверное так нельзя делать, лучше предварительно отправлять эти данные с сервера.</li>
        <li>Вопрос производительности, в моем случае получилось приложение, котоорое очень сильно прожирает память. Думаю, если принимать данные с сервера, в формате json, то это уже сильно ускорит приложение. А если не поможет, можно даже форич переделать в for, если верить Симпсону, он быстрее, хотя возможно на данный момент они как в пайтоне имеют разницу около 10 мс, что не сделает погоду.
        </li>
        <li>У вас там написано, прокрутка должна отсутствовать (горизонтальная тоже??), ну я и задал max-height: 100vh )))</li>
        <li>Адаптивность же нужна только под эти 3 разрешения?</li>
      </ol>
        <h3>P.S. Я долго искал криволинейную диаграмму как на скриншоте, но у Anychart я так и не нашел его в документациях.</h3>
      <h1>Дайте фидбэк за + в карму</h1>
    </div>
    
  </div>
</template>

<style scoped>
.about{
  width: 100%;
  max-width: 1152px;
  margin: 1rem auto;
}
.information{
  width: 100%;
  display: flex;
  flex-direction: column;
  align-items: flex-start;
}
.information ul li, .information ol li{text-align: left;}
</style>
